app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Title sample"], ["body", "body of title"], ["created_at", "2020-08-07 19:05:19.762680"], ["updated_at", "2020-08-07 19:05:19.762680"]]
---
    def create
        @article = Article.new(article_params)
        @article.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "Edit Article"], ["updated_at", "2020-08-06 21:36:55.854928"], ["id", 5]]
---
    def update
        @article = Article.find(params[:id])
        @article.update(article_params)