app/controllers/tags_controller.rb

SELECT "tags".* FROM "tags"
---
    def index
        @tag= Tag.all